#+TITLE: BriteCore Project: Feature Request Web Application

This is my attempt at implementing an engineering project as part of a hiring
process. I will state any assumptions and opinions that I have as I am
developing this web app, but I'm open for answering questions on any part of
this that I didn't explain. This =org-mode= document will serve as my notes.

** Dependencies
   I'm going to use Flask for the backend framework, and I'll need to install
   SQLAlchemy as well. Let's run a couple of =pipenv= commands. First, I'm going
   to run the =uninstall --all= command just to make sure that I have a fresh
   system while I iterate on the code.

   #+BEGIN_SRC sh :results output
     pipenv uninstall --all
     pipenv install flask sqlalchemy
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Un-installing all packages from virtualenv…
   Found 7 installed package(s), purging…
   Uninstalling click-6.7:
     Successfully uninstalled click-6.7
   Uninstalling Flask-0.12.2:
     Successfully uninstalled Flask-0.12.2
   Uninstalling itsdangerous-0.24:
     Successfully uninstalled itsdangerous-0.24
   Uninstalling Jinja2-2.10:
     Successfully uninstalled Jinja2-2.10
   Uninstalling MarkupSafe-1.0:
     Successfully uninstalled MarkupSafe-1.0
   Uninstalling SQLAlchemy-1.1.15:
     Successfully uninstalled SQLAlchemy-1.1.15
   Uninstalling Werkzeug-0.13:
     Successfully uninstalled Werkzeug-0.13

   Environment now purged and fresh!
   Installing flask…
   Collecting flask
     Using cached Flask-0.12.2-py2.py3-none-any.whl
   Collecting Jinja2>=2.4 (from flask)
     Using cached Jinja2-2.10-py2.py3-none-any.whl
   Collecting Werkzeug>=0.7 (from flask)
     Using cached Werkzeug-0.13-py2.py3-none-any.whl
   Collecting click>=2.0 (from flask)
     Using cached click-6.7-py2.py3-none-any.whl
   Collecting itsdangerous>=0.21 (from flask)
   Collecting MarkupSafe>=0.23 (from Jinja2>=2.4->flask)
   Installing collected packages: MarkupSafe, Jinja2, Werkzeug, click, itsdangerous, flask
   Successfully installed Jinja2-2.10 MarkupSafe-1.0 Werkzeug-0.13 click-6.7 flask-0.12.2 itsdangerous-0.24

   Adding flask to Pipfile's [packages]…
   Installing sqlalchemy…
   Collecting sqlalchemy
   Installing collected packages: sqlalchemy
   Successfully installed sqlalchemy-1.1.15

   Adding sqlalchemy to Pipfile's [packages]…
#+end_example

